---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.InvalidParameters
source: html/4f369c7a-c458-1912-652f-cc88e6eac2e2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.InvalidParameters Property

Stairs run or landing has invalid parameter(s).

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidParameters { get; }
```